Revit 2021.1 API
ServiceType Enumeration
An enumerated type listing all of the built-in parameter groups supported by Autodesk Revit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
Syntax
C#
public enum ServiceType
Visual Basic
Public Enumeration ServiceType
Visual C++
public enum class ServiceType
Members
Member name | Description
kNoServiceType | Service Type is NoServiceType.
kCentralHeatingRadiators | Service Type is CentralHeatingRadiators.
kCentralHeatingConvectors | Service Type is CentralHeatingConvectors.
kCentralHeatingRadiantFloor | Service Type is CentralHeatingRadiantFloor.
kCentralHeatingHotAir | Service Type is CentralHeatingHotAir.
kOtherRoomHeater | Service Type is OtherRoomHeater.
kRadiantHeaterFlue | Service Type is RadiantHeaterFlue.
kRadiantHeaterNoFlue | Service Type is RadiantHeaterNoFlue.
kRadiantHeaterMultiburner | Service Type is RadiantHeaterMultiburner.
kForcedConvectionHeaterFlue | Service Type is ForcedConvectionHeaterFlue.
kForcedConvectionHeaterNoFlue | Service Type is ForcedConvectionHeaterNoFlue.
kVAVSingleDuct | Service Type is VAVSingleDuct.
kVAVDualDuct | Service Type is VAVDualDuct.
kVAVIndoorPackagedCabinet | Service Type is VAVIndoorPackagedCabinet.
kVAVTerminalReheat | Service Type is VAVTerminalReheat.
kFanCoilSystem | Service Type is FanCoilSystem.
kInductionSystem | Service Type is InductionSystem.
kConstantVolumeFixedOA | Service Type is ConstantVolumeFixedOA.
kConstantVolumeVariableOA | Service Type is ConstantVolumeVariableOA.
kConstantVolumeTerminalReheat | Service Type is ConstantVolumeTerminalReheat.
kMultizoneHotDeckColdDeck | Service Type is MultizoneHotDeckColdDeck.
kConstantVolumeDualDuct | Service Type is ConstantVolumeDualDuct.
kRadiantCooledCeilings | Service Type is RadiantCooledCeilings.
kActiveChilledBeams | Service Type is ActiveChilledBeams.
kWaterLoopHeatPump | Service Type is WaterLoopHeatPump.
kVariableRefrigerantFlow | Service Type is VariableRefrigerantFlow.
kSplitSystemsWithNaturalVentilation | Service Type is SplitSystemsWithNaturalVentilation.
kSplitSystemsWithMechanicalVentilation | Service Type is SplitSystemsWithMechanicalVentilation.
kSplitSystemsWithMechanicalVentilationWithCooling | Service Type is SplitSystemsWithMechanicalVentilationWithCooling.
Remarks
Parameter groups are used to sort parameters within the gbXML Setting item of the Project Information dialog.
See Also
Autodesk.Revit.DB Namespace